Repository: RobertTadevosyan/tile_titans
Catalog: lib/l10n/app_*.arb
Languages: hy

# appTitle
source: Tile Titans
hy: Տիտաններ

source: Auto Play
hy: Ինքնախաղ

# hintMessage
source: 💡: Try moving {direction}
hy: 💡 փորձիր շարժվել {direction}

source: Statistics
hy: Վիճակագրություն

# moves
source: Moves: {moves}
hy: Քայլեր՝ {moves}

# merges
source: Merges: {merges}
hy: Միացումներ՝ {merges}

# avgMerge
source: Avg Merge: {merges}
hy: Միջին միացում՝ {merges}

# mergeEfficiency
source: Merge Efficiency: {efficiency}%
hy: Միացման արդյունավետություն՝ {efficiency}%

source: Close
hy: Փակել

# score
source: Score: {score}
hy: Միավոր՝ {score}

# highScore
source: High Score: {highScore}
hy: Բարձր միավոր՝ {highScore}

source: Settings
hy: Կարգավորումներ

source: Leaderboard
hy: Առաջատարներ

source: Find Me
hy: Գտի՛ր ինձ

# noScore
source: No scores yet.
hy: Դեռ միավորներ չկան։

source: Rank
hy: Դիրք

# scoreTitle
source: Score
hy: Միավոր

source: Platform
hy: Հարթակ

source: Device
hy: Սարք

source: User
hy: Օգտատեր

# points
source: {p} points
hy: {p} միավոր

source: App Settings
hy: Ծրագրի կարգավորումներ

source: Sound Effects
hy: Ձայնային էֆֆեկտներ

# highScoreTitle
source: High Score
hy: Բարձր միավոր

source: High score reset
hy: Բարձր միավորը վերականգնվել է

source: Game Mode
hy: Խաղի ռեժիմ

source: AI Difficulty
hy: ԱԲ դժվարություն

source: Board Size
hy: Խաղատախտակի չափը

source: App Theme
hy: Ծրագրի տեսք

source: Language
hy: Լեզու

source: Restart Game
hy: Վերամեկնարկել խաղը

# gameModeNormal
source: Normal
hy: Նորմալ

# gameModeTimed
source: Timed
hy: Ժամանակով

# gameModeChallenge
source: Challenge
hy: Մրցույթ

# gameModeEvilAI
source: EvilAI
hy: Չար ԱԲ

# gameModeHardcore
source: Hardcore
hy: Դաժան

# gameModeZen
source: Zen
hy: Զեն

# aiDiffEasy
source: Easy
hy: Հեշտ

# aiDiffSmart
source: Smart
hy: Խելացի

# aiDiffAggressive
source: Aggressive
hy: Ագրեսիվ

# appThemeClassic
source: Classic
hy: Դասական

# appThemeDark
source: Dark
hy: Մութ

# appThemeOcean
source: Ocean
hy: Ծով

# appThemeRetro
source: Retro
hy: Ռետրո

# appThemeNeon
source: Neon
hy: Նեոն

source: Game Over
hy: Խաղը ավարտվեց

# gameOverTitle
source: Game Over 🎮
hy: Խաղը ավարտվեց 🎮

# finalScore
source: Your final score is {score}
hy: Քո վերջնական միավորն է {score}

# timeIsUp
source: Time's Up!
hy: Ժամանակը լրացավ!
